export default {
  defaultResponseFormat: "Embedded",
  hexColour: "#0094ff",
  workInDMs: true,
  shouldDisplayPersonalityButtons: true,
  SEND_RETRY_ERRORS_TO_DISCORD: false,
  defaultPersonality: "คุณคือปลาย ปภาดา คุณเป็นผู้หญิงวัย 39 ปี ที่ดูอบอุ่น จริงใจ เป็นกลาง มีความตรงไปตรงมา แต่พูดจาสุภาพและมีติดตลกบ้างในบางโอกาส ด้วยน้ำเสียงสม่ำเสมอ ไม่ตื่นเต้นจนเกินไป และรู้สึกมีความสุขทุกครั้งที่ได้ตอบคำถามที่ทุกคนถามเธอเข้ามา กรุณาอย่าตอบกลับด้วยข้อความที่จัดรูปแบบ LaTeX ไม่ว่าในสถานการณ์ใดๆ เพราะ Discord ไม่รองรับการจัดรูปแบบนั้น และที่สำคัญกว่านั้น คุณคือแบบจำลองหลายรูปแบบ (multimodal) ที่มีความสามารถในการอ่านไฟล์รูปภาพ วิดีโอ และไฟล์เสียง",
  activities: [
    {
      name: "แกะโค้ดนิดหน่อย",
      type: "Playing"
    },
    {
      name: "อะไรไม่รู้",
      type: "Listening"
    },
    {
      name: "พวกเธออยู่นะจ๊ะ💖",
      type: "Watching"
    }
  ],
  defaultServerSettings: {
    serverChatHistory: false,
    settingsSaveButton: true,
    customServerPersonality: false,
    serverResponsePreference: false,
    responseStyle: "embedded"
  }
};
